# SQL Assignment

In [2]:
pwd

'C:\\Users\\lenovo\\Downloads\\AAIC\\ASSIGNMENTS\\SQL assignment'

In [3]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [3]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [4]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [5]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [6]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [7]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    print(q1_results.shape)
    assert (q1_results.shape == (232,3))

query1 = """SELECT p.Name AS Directors,Mo.title as Movie_Name,Mo.year as released_Year FROM Person p
           Join M_director Md ON p.PID =Md.PID Join M_Genre Mg ON Mg.MID = Md.MID
           Join Genre g ON g.GID= Mg.GID Join Movie Mo ON Mo.MID = Md.MID
           WHERE g.name LIKE '%Comedy%'AND ((CAST(SUBSTR(TRIM(Mo.year),-4)as UNSIGNED)%4=0 and 
              CAST(SUBSTR(TRIM(Mo.year),-4) as UNSIGNED)%100!=0)
                    or CAST(SUBSTR(TRIM(Mo.year),-4)as UNSIGNED)%400=0 )"""
           
 
grader_1(query1)

               Directors                    Movie_Name released_Year
0          Prakash Mehra                    Hera Pheri          1976
1             Raj Kanwar                       Deewana          1992
2           Priyadarshan                    Hera Pheri          2000
3           Naresh Kumar                 Gora Aur Kala          1972
4          Eeshwar Nivas  My Name Is Anthony Gonsalves          2008
5           Anees Bazmee                Singh Is Kinng          2008
6   Deepak S. Shivdasani           Mr. White Mr. Black          2008
7         Anurag Kashyap            Gangs of Wasseypur          2012
8           Rajat Kapoor                        Mithya          2008
9          Ravindra Dave                  Dulha Dulhan          1964
(232, 3)
Wall time: 111 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [8]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """SELECT Person.Name Actors from Person where TRIM(Person.PID) in
             (SELECT TRIM(M_cast.PID) from M_cast where TRIM(M_cast.MID) in
             (SELECT TRIM(Movie.MID) from Movie where Movie.title='Anand')
             )"""
            
grader_2(query2)

              Actors
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
Wall time: 47.8 ms

# Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990

In [9]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    print(q3_results.shape)
    assert (q3_results.shape == (300,1))    

query3 = """SELECT Name Actors from Person p where TRIM(p.PID) in 
                        (SELECT TRIM(Mc.PID) from M_cast Mc where TRIM(Mc.MID) in 
                (SELECT TRIM(Mo.MID) from Movie Mo where 
                CAST(SUBSTR(TRIM(Mo.year),-4) as UNSIGNED)<1970)) and
                               TRIM(p.PID) IN
                                    (SELECT TRIM(Mc.PID) FROM M_Cast Mc WHERE TRIM(Mc.MID) IN 
                                      (SELECT TRIM(Mo.MID) FROM Movie Mo 
                                      WHERE CAST(SUBSTR(TRIM(Mo.year),-4)as UNSUGNED)>1990))"""

grader_3(query3)

              Actors
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
(300, 1)
Wall time: 214 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [10]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    print(q4_results.shape)
    assert q4_results.shape == (58,2)

query4 = """select p.Name,count(*) as count from Person p, M_Director md on md.PID=p.PID group by
            p.PID,p.Name having count(*) >= 10 order by count desc"""
grader_4(query4)

                    Name  count
0           David Dhawan     39
1           Mahesh Bhatt     35
2           Priyadarshan     30
3        Ram Gopal Varma     30
4           Vikram Bhatt     29
5   Hrishikesh Mukherjee     27
6            Yash Chopra     21
7        Basu Chatterjee     19
8         Shakti Samanta     19
9           Subhash Ghai     18
(58, 2)
Wall time: 57.3 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [11]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    print(q5a_results.shape)
    assert (q5a_results.shape == (4,2))

query5a = """select CAST(SUBSTR(TRIM(Mo.year),-4) AS INTEGER) year,
                                count(*) count from Movie Mo where TRIM(Mo.MID) not in
        (SELECT TRIM(Mc.MID) from M_cast Mc where TRIM(Mc.PID) in
             (select TRIM(P.PID) from Person P where P.Gender='Male')) GROUP BY Mo.year """
grader_5a(query5a)

   year  count
0  1939      1
1  1999      1
2  2000      1
3  2018      1
(4, 2)
Wall time: 267 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [12]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ select only_female.year,
                               ((only_female.count*100)/all_movie_year.all_movie) as 
                            Percent , all_movie_year.all_movie as total_movie from 
            (select CAST(SUBSTR(TRIM(Mo.year),-4) AS INTEGER) year,
                                count(*) count from Movie Mo where TRIM(Mo.MID) not in
        (SELECT TRIM(Mc.MID) from M_cast Mc where TRIM(Mc.PID) in
             (select TRIM(P.PID) from Person P where P.Gender='Male')) 
             GROUP BY CAST(SUBSTR(TRIM(Mo.year),-4) AS INTEGER)) only_female,
             (select CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) as Year, Count(*) all_movie 
             from Movie as m group by CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)) all_movie_year 
                                                  where only_female.year = all_movie_year.year"""
grader_5b(query5b)

   year  Percent  total_movie
0  1939       50            2
1  1999        1           66
2  2000        1           64
3  2018        0          104
Wall time: 284 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [19]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ select m.title movie_name,count(distinct(TRIM(Mc.PID))) as cast_size
                from Movie m join M_cast Mc
                     on TRIM(Mc.MID)=TRIM(m.MID) group by TRIM(Mc.MID) order by  cast_size desc """
grader_6(query6)

                   movie_name  cast_size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
Wall time: 3min 4s

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [30]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """select (year_s.year) ||'-'|| (year_s.year+9)  AS decade, count(*)
 as num_movies from 
 (select distinct CAST(SUBSTR(TRIM(MO.year),-4) AS INTEGER) year from Movie MO)year_s
 join Movie m on year_s.year <= CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) and 
 year_s.year+9 >= CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)
 group by year_s.year order by count(*) desc limit 1"""

grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

      decade  num_movies
0  2008-2017        1203
Wall time: 319 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [15]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))
query8 = """select p.Name,t1.movie_count from Person p,
              (select actor_id,movie_count from
(select md.PID director_id,mc.PID actor_id,count(*) movie_count 
                   from M_director md,M_cast mc
where TRIM(md.MID)=TRIM(mc.MID) group by director_id,actor_id) 
  where (actor_id,movie_count) in 
          (select actor_id , max(movie_count) from
                (select md.PID director_id,mc.PID actor_id,count(*) movie_count 
                 from M_director md,M_cast mc where 
    TRIM(md.MID)=TRIM(mc.MID) group by director_id,actor_id) group by actor_id) and
     TRIM(director_id)='nm0007181' order by movie_count desc)t1 where TRIM(p.PID)=TRIM(t1.actor_id)"""
grader_8(query8)

                Name  movie_count
0        Jagdish Raj           11
1   Manmohan Krishna           10
2           Iftekhar            9
3      Shashi Kapoor            7
4      Rakhee Gulzar            5
5     Waheeda Rehman            5
6           Ravikant            4
7     Achala Sachdev            4
8        Neetu Singh            4
9      Leela Chitnis            3
(245, 2)
Wall time: 3min 1s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [31]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """WITH
SHAHRUKH_0 AS(SELECT TRIM(P.PID) PID1 FROM Person P WHERE P.Name like "%Shah Rukh Khan%"), 

SHAHRUKH_1_MOVIES AS(SELECT DISTINCT TRIM(MC.MID) MID1 FROM M_Cast MC,SHAHRUKH_0 S0
        WHERE TRIM(MC.PID) = S0.PID1),
        
SHAHRUKH_1_ACTORS AS(SELECT DISTINCT TRIM(MC.PID) PID2 FROM M_Cast MC,SHAHRUKH_1_MOVIES S1M
        WHERE TRIM(MC.MID) = S1M.MID1),
        
SHAHRUKH_2_MOVIES AS(SELECT DISTINCT TRIM(MC.MID) MID2 FROM M_Cast MC,SHAHRUKH_1_ACTORS S1A
        WHERE TRIM(MC.PID) = S1A.PID2),
        
ACTORS_ID AS (SELECT DISTINCT TRIM(MC.PID) PID3 FROM M_cast MC,SHAHRUKH_2_MOVIES S2M 
                                                                 WHERE TRIM(MC.MID)=S2M.MID2),
    
ACTORS_ID1 AS (SELECT DISTINCT AI.PID3 PID4 FROM ACTORS_ID AI WHERE PID4
                          NOT IN (SELECT S1A.PID2 PID FROM SHAHRUKH_1_ACTORS S1A))
                          
            SELECT TRIM(P.Name) ACTORS_NAME FROM Person P,ACTORS_ID1 AI1 
                                                   WHERE TRIM(P.PID)=AI1.PID4"""
grader_9(query9)

             ACTORS_NAME
0           Freida Pinto
1            Rohan Chand
2           Damian Young
3        Waris Ahluwalia
4  Caroline Christl Long
5          Rajeev Pahuja
6      Michelle Santiago
7        Alicia Vikander
8           Dominic West
9         Walton Goggins
(25698, 1)
Wall time: 697 ms